#+last-update-time: Mon May 15 08:45:22 2023
#+exclude-from-graph-view: false
#+title: MIT-Missing-Semester
#+tags: Course, Vim, Git

*** DONE 1. Complete ~vimtutor~.
:PROPERTIES:
:END:
:LOGBOOK:
CLOCK: [2023-02-08 Wed 22:17:50]--[2023-02-08 Wed 22:23:29] =>  00:05:39
CLOCK: [2023-02-09 Thu 07:01:28]--[2023-02-09 Thu 07:37:12] =>  00:35:44
CLOCK: [2023-02-09 Thu 08:06:50]--[2023-02-09 Thu 08:29:03] =>  00:22:13
CLOCK: [2023-02-09 Thu 08:41:46]--[2023-02-09 Thu 08:43:09] =>  00:01:23
:END:
*** DONE 2. Download our basic vimrc and save it to =/.vimrc=. Read through the well-commented file (using Vim!), and observe how Vim looks and behaves slightly differently with the new config.
:LOGBOOK:
CLOCK: [2023-02-09 Thu 08:46:41]--[2023-02-09 Thu 08:52:44] =>  00:06:03
:END:
*** DONE 2. Find the number of words (in =/usr/share/dict/words=) that contain at least three =a=s and don't have a ='s= ending. What are the three most common last two letters of those words? =sed='s =y= command, or the =tr= program, may help you with case insensitivity. How many of those two-letter combinations are there? And for a challenge: which combinations do not occur?
:PROPERTIES:
:END:
:LOGBOOK:
CLOCK: [2023-02-10 Fri 11:40:00]--[2023-02-10 Fri 12:00:00] =>  00:20:00
CLOCK: [2023-02-10 Fri 15:37:32]--[2023-02-10 Fri 16:58:20] =>  01:20:48
:END:
*** DONE 5. Look for boot messages that are _not_ shared between your past three reboots (see =journalctl='s =-b= flag). Break this task down into multiple steps. First, find a way to get just the logs from the past three boots. There may be an applicable flag on the tool you use to extract the boot logs, or you can use =sed '0,/STRING/d'= to remove all lines previous to one that matches =STRING=. Next, remove any parts of the line that _always_ varies (like the timestamp). Then, de-duplicate the input lines and keep a count of each one (=uniq= is your friend). And finally, eliminate any line whose count is 3 (since it _was_ shared among all the boots).
:LOGBOOK:
CLOCK: [2023-02-12 Sun 06:55:01]--[2023-02-12 Sun 08:46:46] =>  01:51:45
:END:
